<?php

return [
    // +----------------------------------------------------------------------
    // | 应用设置
    // +----------------------------------------------------------------------
    // 默认Host地址
    'app_host'               => '',
    // 应用调试模式
    'app_debug'              => true,
    // 应用模式状态：1-正常，2-维护
    'app_status'             => '1',
    // 是否支持多模块
    'app_multi_module'       => true,
    // 注册的根命名空间
    'root_namespace'         => [],
    // 扩展函数文件
    'extra_file_list'        => [SMART_PATH . 'common/helper.php'],
    // 默认时区
    'default_timezone'       => 'PRC',
    // 默认日志路径
    'default_log_path'       => LOGS_PATH,

    // +----------------------------------------------------------------------
    // | 模块设置
    // +----------------------------------------------------------------------
    // 默认模块名
    'default_module'         => '',
    // 默认控制器名
    'default_controller'     => 'index',
    // 默认操作名
    'default_action'         => 'index',

    // +----------------------------------------------------------------------
    // | URL设置
    // +----------------------------------------------------------------------
    // 是否开启路由
    'url_route_on'           => true,
    // 是否强制使用路由
    'url_route_must'         => false,
    // 路由配置文件（支持配置多个）
    'route_config_file'      => [],

    // +----------------------------------------------------------------------
    // | 异常及错误设置
    // +----------------------------------------------------------------------
    // 错误信息输出
    'error_render'           => true,
    // 显示错误信息
    'show_error_msg'         => false,
    // 异常处理handle类 留空使用 \smart\exception\Handle
    'exception_handle'       => '',
    // 错误显示信息,非调试模式有效
    'error_message'          => '页面错误！请稍后再试～',

    // +----------------------------------------------------------------------
    // | 会话设置
    // +----------------------------------------------------------------------
    'session'   => [
        // 驱动方式 支持redis
        'type'           => '',
        // 是否自动开启 SESSION
        'auto_start'     => true,
        // 禁止客户端读取SESSION相关Cookie
        'httponly'       => true,
        // 安全模式传输（仅支持HTTPS）
        'secure'         => false,
        // SESSIONID前缀
        'session_name'   => 'sess_',
        // 有效时间
        'expire'         => 3600,
        // 保存路径（type为空时有效）
        'path'           => RUNTIME_PATH . 'sess',
    ],

    // +----------------------------------------------------------------------
    // | 数据加密
    // +----------------------------------------------------------------------
    'crypt'     => [
        // RSA类型 支持rsa1, rsa2
        'type'              => 'rsa1',
        'public_key'        => '',
        'private_key'       => '',
        'public_key_path'   => SMART_PATH . 'data/rsa_public_key.pem',
        'private_key_path'  => SMART_PATH . 'data/rsa_private_key.pem',
    ],

    // +----------------------------------------------------------------------
    // | 数据库设置
    // +----------------------------------------------------------------------
    'database' => [
        // PDO连接配置
        'pdo'   => 'database/pdo',
        // Redis连接配置
        'redis' => 'database/redis'
    ],

    // +----------------------------------------------------------------------
    // | 存储设置
    // +----------------------------------------------------------------------
    'storage_host' => 'http://localhost/upload/',
];
